Tekla Open API Reference for Tekla Structures 2025
AnalysisModelJobProperties.CheckerDate Property
 The date of the checking.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DateTime CheckerDate { get; set; }
Public Property CheckerDate As DateTime
	Get
	Set
Property Value
Type: DateTime
See Also
Reference
AnalysisModelJobProperties Class
Tekla.Structures.Analysis Namespace